In [83]:
https://www.cnblogs.com/Yanjy-OnlyOne/p/11195621.html

SyntaxError: invalid syntax (<ipython-input-83-7ccee00602a3>, line 1)

In [2]:
import numpy as np
import pandas as pd 

df_train = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a','b','a','a','a','a'],
                                    'key2':['one', 'two', 'one', 'two', 'one','two','one','one','two','one'],
                                    'data1':np.random.randn(10),
                                    'data2':np.random.randn(10),
                                     'data3':[1,2,3,4,5,6,7,8,9,10],
                                     'data4':[1,2,np.nan,4,np.nan,6,np.nan,8,np.nan,10]
                                    })
df_train

  key1 key2     data1     data2  data3  data4
0    a  one  1.352457  0.697491      1    1.0
1    a  two -0.854915 -0.453865      2    2.0
2    b  one -0.220286  0.039453      3    NaN
3    b  two -1.837247 -0.491375      4    4.0
4    a  one  1.300297  0.353234      5    NaN
5    b  two -0.276514 -0.174656      6    6.0
6    a  one -2.438377  1.009057      7    NaN
7    a  one  1.889475 -0.109600      8    8.0
8    a  two  1.973577 -0.478925      9    NaN
9    a  one  0.303279  0.228619     10   10.0

In [3]:
df1 = pd.DataFrame([[1,2,3],[1,10,20],[5,6,7],[3,9,0],[8,0,3]],columns=['x1','x2','x3'])
df1

   x1  x2  x3
0   1   2   3
1   1  10  20
2   5   6   7
3   3   9   0
4   8   0   3

In [ ]:
# index 必须有
# 可能因为key2不好求mean，所以不显示

df_train.pivot_table(index=['key1'])

In [ ]:
df_train.pivot_table(index=['key1','key2'])

In [84]:
df_train.pivot_table(index=['key1','key2'], values=['data1','data4'])

              data1     data4
key1 key2
a    one  -0.502795  6.333333
     two  -0.716559  2.000000
b    one  -0.708731       NaN
     two   0.463422  5.000000

In [85]:
df_train.pivot_table(index=['key1','key2'], values=['data1','data4'], aggfunc=[np.sum,np.mean])

                sum            mean
              data1 data4     data1     data4
key1 key2
a    one  -2.513974  19.0 -0.502795  6.333333
     two  -1.433118   2.0 -0.716559  2.000000
b    one  -0.708731   0.0 -0.708731       NaN
     two   0.926844  10.0  0.463422  5.000000

In [86]:
df_train.pivot_table(index=['key1','key2'], values=['data1','data4'], aggfunc=[np.sum,np.mean],
                            fill_value=0)

                sum            mean
              data1 data4     data1     data4
key1 key2
a    one  -2.513974    19 -0.502795  6.333333
     two  -1.433118     2 -0.716559  2.000000
b    one  -0.708731     0 -0.708731  0.000000
     two   0.926844    10  0.463422  5.000000

In [87]:
# margins=True 汇总

df_train.pivot_table(index=['key1','key2'], values=['data1','data4'], aggfunc=[np.sum,np.mean],
                            fill_value=0,margins=True)

                sum            mean
              data1 data4     data1     data4
key1 key2
a    one  -2.513974    19 -0.502795  6.333333
     two  -1.433118     2 -0.716559  2.000000
b    one  -0.708731     0 -0.708731  0.000000
     two   0.926844    10  0.463422  5.000000
All       -2.658923    31 -0.443154  5.166667

In [88]:
# columns 与 index 组成类似于二维矩阵的i, j

df_train.pivot_table(index=['key1'], values=['data1','data4'], aggfunc=[np.sum])

           sum
         data1 data4
key1
a    -3.947092  21.0
b     0.218112  10.0

In [89]:
df_train.pivot_table(index=['key1','key2'], values=['data1','data4'], aggfunc=[np.sum])

                sum
              data1 data4
key1 key2
a    one  -2.513974  19.0
     two  -1.433118   2.0
b    one  -0.708731   0.0
     two   0.926844  10.0

In [90]:
df_train.pivot_table(index=['key1'],columns=['key2'],values=['data1','data4'], aggfunc=[np.sum])

           sum
         data1           data4
key2       one       two   one   two
key1
a    -2.513974 -1.433118  19.0   2.0
b    -0.708731  0.926844   0.0  10.0

# 对列名(index、columns)的处理

In [91]:
table = df_train.pivot_table(index=['key1'],columns=['key2'],values=['data1','data4'], aggfunc=[np.sum])
table

           sum
         data1           data4
key2       one       two   one   two
key1
a    -2.513974 -1.433118  19.0   2.0
b    -0.708731  0.926844   0.0  10.0

In [92]:
table.columns

MultiIndex([('sum', 'data1', 'one'),
            ('sum', 'data1', 'two'),
            ('sum', 'data4', 'one'),
            ('sum', 'data4', 'two')],
           names=[None, None, 'key2'])

## droplevel（处理Multilndex）
### 删除一层列名，从上删到下

In [93]:
table.columns.droplevel()

MultiIndex([('data1', 'one'),
            ('data1', 'two'),
            ('data4', 'one'),
            ('data4', 'two')],
           names=[None, 'key2'])

In [94]:
table.columns.droplevel().droplevel()

Index(['one', 'two', 'one', 'two'], dtype='object', name='key2')

In [95]:
table.columns = table.columns.droplevel()  # 需要赋值 !!!!!!

In [114]:
print(type(table.columns))

<class 'pandas.core.indexes.base.Index'>

In [116]:
# 单独赋值

table.columns[0] # 这样只能读取不能赋值
table.columns.values[0] = 'three'  # 只能这样单独赋值
table.columns

Index(['three', 'two', 'one', 'two'], dtype='object', name='key2')

## reset_index、rename_axis(给序号(第一列)命名)
### 处理序号(第一列)

In [96]:
table

         data1           data4
key2       one       two   one   two
key1
a    -2.513974 -1.433118  19.0   2.0
b    -0.708731  0.926844   0.0  10.0

In [97]:
table.reset_index(drop=True, inplace=False)  # inplace是否修改原表，也可以通过= 实现

table = table.reset_index(drop=True)
table

         data1           data4
key2       one       two   one   two
0    -2.513974 -1.433118  19.0   2.0
1    -0.708731  0.926844   0.0  10.0

In [103]:
table.rename_axis('ID')

         data1           data4
key2       one       two   one   two
ID
0    -2.513974 -1.433118  19.0   2.0
1    -0.708731  0.926844   0.0  10.0

In [104]:
table.columns = table.columns.droplevel() 
table.rename_axis(None, axis=1)     # axis=1 , 貌似需要第一列只有一列 !!!

        one       two   one   two
0 -2.513974 -1.433118  19.0   2.0
1 -0.708731  0.926844   0.0  10.0